Revit 2024 API
ElectricalSystem.CircuitConnectionType Property
 The circuit connection type of the electrical system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public CircuitConnectionType CircuitConnectionType { get; set; }
Visual Basic
Public Property CircuitConnectionType As CircuitConnectionType
	Get
	Set
Visual C++
public:
property CircuitConnectionType CircuitConnectionType {
	CircuitConnectionType get ();
	void set (CircuitConnectionType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The connection type is invalid for this circuit. You can't assign Feed Through Lugs if the panel's Feed Through Lugs option is unchecked. If the circuit's base panel is not a data panel or transformer panel, the circuit connection type can't be set to NotApplicable. If the circuit's base panel is a data panel or transformer pane, it must be set to NotApplicable. If the circuit doesn't have a base panel, it must be set to NotApplicable. -or- When setting this property: Invalid connection type.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace